# KeynoteEntries Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeynoteEntries Class
Members See Also
---
A collection of KeynoteEntry objects that make up the keynote table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class KeynoteEntries : KeyBasedTreeEntries
```

Visual Basic
---
```text
Public Class KeynoteEntries _
	Inherits KeyBasedTreeEntries
```

Visual C++
---
```text
public ref class KeynoteEntries : public KeyBasedTreeEntries
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..KeyBasedTreeEntries Autodesk.Revit.DB..::..KeynoteEntries
# See Also
KeynoteEntries Members
Autodesk.Revit.DB Namespace